{
  "id": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491_a3c54aed-55ee-49d1-aaf8-ab58007e49f9_003",
  "title": "Quiz 3: Maternal & Newborn II",
  "subjectId": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491",
  "topicId": "a3c54aed-55ee-49d1-aaf8-ab58007e49f9",
  "topicName": "1.2 Maternal & Newborn Health Collection",
  "description": "Diploma in Community Health Nursing - Year 1 Semester 2",
  "isPaid": true,
  "timeLimit": 18,
  "passingScore": 70,
  "version": 1,
  "order": 3,
  "questions": [
    {
      "id": "q1",
      "type": "short-answer",
      "question": "Outline five (5) preventive measures of iron deficiency in pregnancy. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Routine Iron Supplementation (IFAS): Administration of daily oral iron and folic acid supplements throughout pregnancy. Dietary Counseling: Encouraging consumption of iron-rich foods (e.g., red meat, green leafy vegetables, beans) and Vitamin C to enhance absorption. Malaria Control: Use of Insecticide Treated Nets (ITNs) and Intermittent Presumptive Treatment (IPTp) to prevent hemolysis. Deworming: Administration of anti-helminthic drugs (e.g., Mebendazole/Albendazole) in the second trimester to treat hookworm infestation. Birth Spacing: Encouraging family planning to allow replenishment of maternal iron stores between pregnancies (at least 2 years).",
      "hint": null
    },
    {
      "id": "q2",
      "type": "short-answer",
      "question": "Outline five (5) effects of Malaria in pregnancy to the mother. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Severe Anaemia: Due to destruction of red blood cells by the parasite. Hypoglycemia: As a complication of severe malaria or quinine therapy. Cerebral Malaria: Leading to convulsions and coma. Pulmonary Edema: Fluid accumulation in the lungs causing respiratory distress. Puerperal Sepsis: Increased susceptibility to infections post-delivery due to immunosuppression and anaemia. Maternal Death: In severe, complicated cases.",
      "hint": null
    },
    {
      "id": "q3",
      "type": "short-answer",
      "question": "Explain four major causes of post-partum haemorrhage. (8 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Mnemonic: The 4 Ts Tone (Uterine Atony): The uterus fails to contract after delivery, leaving blood vessels at the placental site open. This is the most common cause (approx. 70%). Trauma: Lacerations or tears of the cervix, vagina, or perineum, or uterine rupture during delivery, leading to bleeding despite a contracted uterus. Tissue (Retained Tissue): Retention of placenta, placental fragments, or membranes prevents the uterus from contracting effectively, causing bleeding. Thrombin (Coagulopathy): Pre-existing or acquired bleeding disorders (e.g., DIC, Hemophilia) that prevent blood clotting.",
      "hint": null
    },
    {
      "id": "q4",
      "type": "short-answer",
      "question": "State five (5) steps of maternal perinatal death surveillance response (MPDSR). (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Identification and Notification: Detecting and reporting maternal and perinatal deaths within 24 hours. Review (Audit): Investigating the causes and circumstances (medical and non-medical) surrounding the death. Analysis: Aggregating data to identify trends, avoidable factors, and systemic gaps. Response (Action): Implementing recommendations and corrective actions to prevent future deaths. Monitoring and Evaluation: Assessing the implementation of recommendations and their impact on quality of care.",
      "hint": null
    },
    {
      "id": "q5",
      "type": "short-answer",
      "question": "State five (5) signs and symptoms of intrauterine foetal death. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Cessation of Fetal Movements: The mother reports the baby has stopped moving. Absence of Fetal Heart Tones: No heart beat detected on auscultation or Doppler. Regression of Pregnancy Signs: Breast engorgement subsides, and maternal weight may decrease. Uterine Size Discrepancy: Fundal height is smaller than dates or stops increasing. Brownish Vaginal Discharge: Sometimes present (old blood). Cold Abdomen: In some cases, the mother may report the abdomen feels cold or heavy.",
      "hint": null
    },
    {
      "id": "q6",
      "type": "short-answer",
      "question": "State five (5) predisposing factors to puerperal sepsis. (6 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Prolonged Labour: Increased exposure to ascending infections. Premature Rupture of Membranes (PROM): Loss of the protective amniotic barrier for >18-24 hours. Frequent Vaginal Examinations: Introducing bacteria into the genital tract (more than 5 exams is a risk factor). Anaemia/Malnutrition: Lowers maternal immunity and resistance to infection. Caesarean Section/Instrumental Delivery: Invasive procedures increase trauma and infection risk. Retained Products of Conception: Necrotic tissue provides a medium for bacterial growth.",
      "hint": null
    },
    {
      "id": "q7",
      "type": "short-answer",
      "question": "Outline five (5) causes of uterine rupture. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Previous Uterine Scar: From Caesarean section or myomectomy (scar dehiscence). Obstructed Labour: Neglected obstruction leads to thinning and rupture of the lower uterine segment. Injudicious Use of Oxytocics: Hyperstimulation of the uterus with Oxytocin or Misoprostol. High Parity (Grand Multiparity): Weakened uterine musculature from repeated pregnancies. Traumatic Maneuvers: Difficult forceps delivery, breech extraction, or internal podalic version.",
      "hint": null
    },
    {
      "id": "q8",
      "type": "short-answer",
      "question": "Baby Tina is admitted in the newborn unit with diagnosis of severe neonatal jaundice on phototherapy.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Neonatal jaundice is the yellow discoloration of the skin, sclera, and mucous membranes in a newborn due to elevated levels of bilirubin in the blood (hyperbilirubinemia).",
      "hint": null
    },
    {
      "id": "q9",
      "type": "short-answer",
      "question": "A 35 years old multipara is admitted with cord prolapse at 40 weeks' gestation.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Cord prolapse is the descent of the umbilical cord through the cervix alongside (occult) or past (overt) the presenting part in the presence of ruptured membranes.",
      "hint": null
    }
  ]
}