{
  "id": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491_2dd8f5ca-3afa-4254-9676-cff82e6dfbc6_001",
  "title": "Quiz 1: Fundamentals of Nursing II & Pulmonary Nursing",
  "subjectId": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491",
  "topicId": "2dd8f5ca-3afa-4254-9676-cff82e6dfbc6",
  "topicName": "1.2 Fundamentals & Pulmonary Nursing Collection",
  "description": "Diploma in Community Health Nursing - Year 1 Semester 2",
  "isPaid": true,
  "timeLimit": 22,
  "passingScore": 70,
  "version": 1,
  "order": 1,
  "questions": [
    {
      "id": "q1",
      "type": "short-answer",
      "question": "Explain the following types of Nursing diagnosis (6 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Actual Nursing Diagnosis: Describes a human response to a health condition that currently exists in an individual, family, or community. It is supported by defining characteristics (signs and symptoms) that cluster in patterns. Example: Ineffective Airway Clearance . Risk Nursing Diagnosis: Describes human responses to health conditions that may develop in a vulnerable individual, family, or community. It is supported by risk factors (no signs/symptoms present yet). Example: Risk for Infection . Health Promotion (Wellness) Nursing Diagnosis: A clinical judgment of a person's, family's, or community's motivation and desire to increase well-being and actualize human health potential. Example: Readiness for Enhanced Nutrition . Syndrome Nursing Diagnosis: A cluster of actual or risk nursing diagnoses that are predicted to present because of a certain situation or event. Example: Rape-Trauma Syndrome .",
      "hint": null
    },
    {
      "id": "q2",
      "type": "short-answer",
      "question": "All nursing interventions are patient-focused and goal directed. Explain THREE (3) types of nursing interventions. (6 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Independent (Nurse-Initiated) Interventions: Actions that a nurse initiates without a physician's order, based on scientific rationale and nursing knowledge. Example: Patient positioning, health education, providing comfort measures. Dependent (Physician-Initiated) Interventions: Actions that require an order from a physician or other health care professional but are carried out by the nurse. Example: Administering medication, inserting an IV line, wound dressing (as ordered). Collaborative (Interdependent) Interventions: Therapies that require the combined knowledge, skill, and expertise of multiple health care professionals. Example: Monitoring a patient with a complex condition alongside physiotherapists, dietitians, and doctors.",
      "hint": null
    },
    {
      "id": "q3",
      "type": "short-answer",
      "question": "Scenario A: A conscious patient has been brought to your ward for admission and you are the admitting nurse.Scenario B: A patient has suddenly collapsed while queuing outside the injection room.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Primary Source (The Patient): Since the patient is conscious, they can provide subjective information directly.",
      "hint": null
    },
    {
      "id": "q4",
      "type": "short-answer",
      "question": "Outline FOUR (4) barriers to effective nursing care studies (4 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Inadequate Resources: Lack of equipment, supplies, or staff to implement planned care. Patient Non-compliance: The patient refusing care or failing to follow instructions. Communication Gaps: Poor communication between the nurse, patient, family, or other healthcare team members. Time Constraints: Heavy workload preventing thorough assessment and implementation of care. Lack of Knowledge/Skills: Incompetence or lack of training in specific nursing procedures. Cultural/Language Barriers: Differences that hinder understanding and acceptance of care.",
      "hint": null
    },
    {
      "id": "q5",
      "type": "short-answer",
      "question": "Mr. Rocky 45 years old, a motorcycle rider, has been admitted to surgical ward with diagnosis of severe head injury after having been involved in a Road Traffic Accident.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "i. Decerebrate posture: An abnormal body posture that involves the arms and legs being held straight out (extension), the toes being pointed downward, and the head and neck being arched backward. It indicates severe damage to the brain, specifically the brainstem. ii. Decorticate posture: An abnormal body posture that involves the arms being flexed (bent) over the chest, hands clenched into fists, and legs extended. It indicates damage to the cerebral hemispheres, internal capsule, or thalamus.",
      "hint": null
    },
    {
      "id": "q6",
      "type": "short-answer",
      "question": "Define the following respiratory disorders /terms (2 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Emphysema is a chronic respiratory condition characterized by the destruction of alveolar walls, leading to enlarged air spaces, loss of lung elasticity, and air trapping.",
      "hint": null
    },
    {
      "id": "q7",
      "type": "short-answer",
      "question": "With a well labeled diagram draw the lower respiratory system (5 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Key Components to Draw and Label: Trachea: The windpipe extending from the larynx. Primary Bronchi: Right and Left main bronchi branching from the trachea. Bronchioles: Smaller branches within the lungs. Alveoli: Air sacs at the end of bronchioles (can be shown in a zoomed-in section). Lungs: Right (3 lobes) and Left (2 lobes). Diaphragm: Muscle sheet below the lungs. (Diagram should show the tree-like structure branching down into the lungs).",
      "hint": null
    },
    {
      "id": "q8",
      "type": "short-answer",
      "question": "State five factors associated with increase in asthma attacks (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Allergens: Pollen, dust mites, pet dander, mold spores. Respiratory Infections: Viral colds, flu, pneumonia. Physical Activity: Exercise-induced asthma (especially in cold/dry air). Environmental Pollutants: Smoke, chemical fumes, strong odors/perfumes. Weather Changes: Cold air or extreme humidity. Emotions: Stress, anxiety, excessive laughing or crying. Medications: Aspirin, NSAIDs, Beta-blockers.",
      "hint": null
    },
    {
      "id": "q9",
      "type": "short-answer",
      "question": "State five types of Chest injuries (5 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Rib Fractures: Breakage of one or more ribs (most common). Flail Chest: Multiple consecutive rib fractures in two or more places, creating a floating segment. Pneumothorax: Air in the pleural space (can be Open, Closed, or Tension). Hemothorax: Blood in the pleural space. Pulmonary Contusion: Bruising of the lung tissue. Cardiac Tamponade: Blood in the pericardial sac compressing the heart.",
      "hint": null
    },
    {
      "id": "q10",
      "type": "short-answer",
      "question": "State three (3) teachings to a patient diagnosed with bronchiectasis (3 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Chest Physiotherapy: Teach postural drainage and percussion techniques to help clear secretions daily. Infection Prevention: Importance of annual flu vaccines and pneumonia vaccines; avoiding crowds during flu season. Hydration: Drink plenty of fluids (2-3 liters/day) to thin mucus for easier expectoration. Medication Adherence: Complete full courses of antibiotics and use bronchodilators/mucolytics as prescribed. Smoking Cessation: Avoid smoking and exposure to second-hand smoke.",
      "hint": null
    },
    {
      "id": "q11",
      "type": "short-answer",
      "question": "Mr. John aged 40 years, following a road traffic accident sustained blunt chest injuries of the chest and got admitted in a Surgical ward where he has been diagnosed with Haemothorax and underwater seal drainage has been set up.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Dyspnea: Difficulty breathing or shortness of breath. Chest Pain: Pleuritic pain worsened by breathing. Tachycardia: Rapid heart rate (due to shock/hypoxia). Dullness on Percussion: Over the affected area (fluid). Decreased Breath Sounds: On the affected side. Hypotension: If significant blood loss occurred.",
      "hint": null
    }
  ]
}