{
  "id": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491_82fbb356-14a1-476f-8587-5f2aba8e6337_001",
  "title": "Quiz 1: First Aid, Trauma & Emergency",
  "subjectId": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491",
  "topicId": "82fbb356-14a1-476f-8587-5f2aba8e6337",
  "topicName": "1.2 First Aid & Emergency Collection",
  "description": "Diploma in Community Health Nursing - Year 1 Semester 2",
  "isPaid": true,
  "timeLimit": 10,
  "passingScore": 70,
  "version": 1,
  "order": 1,
  "questions": [
    {
      "id": "q1",
      "type": "short-answer",
      "question": "Outline five (5) methods of giving rescue breaths. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Mouth-to-Mouth: The standard method where the rescuer seals their mouth over the victim's mouth and pinches the nose. Mouth-to-Nose: Used when the victim's mouth cannot be opened (trismus), has injury, or a seal cannot be maintained. The rescuer seals their mouth over the victim's nose. Mouth-to-Mouth-and-Nose: Used for infants; the rescuer covers both the baby's mouth and nose with their mouth. Mouth-to-Stoma: Used for patients with a permanent tracheostomy/laryngectomy stoma. Mouth-to-Mask (Pocket Mask): Using a barrier device with a one-way valve to prevent direct contact. Bag-Valve-Mask (BVM): Manual resuscitation using a self-inflating bag (Ambu bag) and mask, typically by healthcare providers. (Any 5 methods)",
      "hint": null
    },
    {
      "id": "q2",
      "type": "short-answer",
      "question": "Outline five (5) components of the primary survey protocol. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "The Primary Survey follows the DRABC protocol to identify and treat life-threatening conditions immediately: D - Danger: Check for danger to self, bystanders, and the casualty. R - Response: Check the casualty's level of consciousness (AVPU - Alert, Voice, Pain, Unresponsive). A - Airway: Check if the airway is patent; perform head-tilt/chin-lift or jaw thrust if necessary. B - Breathing: Look, Listen, and Feel for normal breathing (not more than 10 seconds). C - Circulation: Check for a pulse (healthcare providers) and check for/control severe bleeding.",
      "hint": null
    },
    {
      "id": "q3",
      "type": "short-answer",
      "question": "Describe the ABCDE APPROACH as used in trauma and emergency. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "The ABCDE approach is a systematic method for assessing and treating critically ill or injured patients: A - Airway (with C-spine protection): Assess for airway obstruction and ensure it is open/patent while protecting the cervical spine in trauma. B - Breathing: Assess respiratory rate, depth, and oxygen saturation. Look for signs of respiratory distress (cyanosis, accessory muscle use). C - Circulation (with Hemorrhage Control): Assess pulse, blood pressure, capillary refill, and skin color/temperature. Identify and control external bleeding. D - Disability (Neurological Status): Assess level of consciousness (AVPU or GCS) and pupil reaction to light. Check blood glucose. E - Exposure/Environment: Remove clothing to perform a full assessment for other injuries while preventing hypothermia (keep patient warm).",
      "hint": null
    },
    {
      "id": "q4",
      "type": "short-answer",
      "question": "State five (5) roles of a triage nurse. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Rapid Assessment: Quickly assessing presenting patients to determine severity of condition. Prioritization: Categorizing patients into urgency levels (e.g., Emergent, Urgent, Non-urgent) to ensure the sickest are treated first. Initiating First Aid/Emergency Care: Providing immediate interventions (e.g., controlling bleeding, applying oxygen) while waiting for the physician. Traffic Control/Flow Management: directing patients to the appropriate treatment areas to maintain order and efficiency. Communication: Liaising between patients, families, and the medical team regarding status and wait times. Documentation: Recording initial assessment findings, vital signs, and triage category.",
      "hint": null
    },
    {
      "id": "q5",
      "type": "short-answer",
      "question": "A 30-year-old man is brought by police officer at the casualty with history of injury to the leg following road traffic accident bleeding profusely in shock.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Tachycardia (Rapid Pulse): The heart beats faster (>100 bpm) to maintain cardiac output despite reduced blood volume. Hypotension (Low Blood Pressure): A late sign indicating significant blood loss (Class III/IV hemorrhage) where compensatory mechanisms fail (Systolic BP < 90 mmHg). Tachypnea (Rapid Breathing): Increased respiratory rate to improve oxygenation and compensate for metabolic acidosis. Cool, Clammy, Pale Skin: Result of peripheral vasoconstriction shunting blood away from the skin to vital organs. Oliguria (Decreased Urine Output): Kidneys conserve water due to reduced renal perfusion (Output < 30ml/hr). Altered Mental Status: Anxiety, restlessness, confusion, or unconsciousness due to cerebral hypoxia. Weak/Thready Pulse: Due to decreased stroke volume. (Any 5 points well discussed for 2 marks each)",
      "hint": null
    }
  ]
}