{
  "id": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491_b4ca50ee-6052-42ab-b085-d1d83bf8b258_003",
  "title": "Quiz 3: Gender, Sexual Health, FP & RH",
  "subjectId": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491",
  "topicId": "b4ca50ee-6052-42ab-b085-d1d83bf8b258",
  "topicName": "1.2 Reproductive Health & Gender Collection",
  "description": "Diploma in Community Health Nursing - Year 1 Semester 2",
  "isPaid": true,
  "timeLimit": 20,
  "passingScore": 70,
  "version": 1,
  "order": 3,
  "questions": [
    {
      "id": "q1",
      "type": "short-answer",
      "question": "List SIX (6) effects of early marriage on health. (3 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Obstructed Labour: Due to cephalopelvic disproportion in a growing pelvis. Obstetric Fistula: A devastating complication of prolonged obstructed labour. Maternal Mortality: Higher risk of death during childbirth. Poor Perinatal Outcomes: Increased risk of prematurity, low birth weight, and stillbirths. Malnutrition/Anemia: Increased nutritional demands of pregnancy on a growing adolescent body. Mental Health Issues: Depression, isolation, and psychological trauma. Increased susceptibility to STIs/HIV: Due to inability to negotiate safe sex.",
      "hint": null
    },
    {
      "id": "q2",
      "type": "short-answer",
      "question": "Explain THREE (3) differences between gender and sex. (6 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Characteristics Sex Gender Definition Biological and physiological characteristics (genes, hormones, anatomy). Socially constructed roles, behaviors, and attributes. Nature Generally permanent and universal (Male/Female). Dynamic and varies across cultures/time (Masculine/Feminine). Determination Determined by biology/birth. Learned through socialization.",
      "hint": null
    },
    {
      "id": "q3",
      "type": "short-answer",
      "question": "Explain THREE (3) tools used in Gender analysis. (6 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "The Harvard Analytical Framework (Activity Profile): Analyzes \"who does what\" (productive, reproductive, community roles), \"who has what\" (access to resources), and \"who controls what\" (decision making). The Moser Framework: Focuses on strategic gender needs (status, power) vs. practical gender needs (basic needs) and the triple role of women (productive, reproductive, community management). The Sara Longwe Framework (Women's Empowerment Framework): Assesses the level of women's empowerment across five levels: Welfare, Access, Conscientization, Participation, and Control. 24-Hour Activity Clock: A visual tool to map out the daily activities of men and women to highlight disparities in workload and leisure.",
      "hint": null
    },
    {
      "id": "q4",
      "type": "short-answer",
      "question": "State FIVE (5) roles of the community in preventing gender based violence. (5 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Reporting: Identifying and reporting cases of GBV to authorities (Police, Chiefs). Support: Providing safe spaces, shelter, and emotional support to survivors. Advocacy/Education: Sensitizing community members against harmful cultural practices (e.g., FGM, wife beating). Intervention: Community policing and intervening to stop violence when it occurs (\"Nyumba Kumi\"). Social Sanctions: Stigmatizing perpetrators and refusing to accept violence as a norm. Resource Mobilization: Supporting victims with transport or funds to access healthcare/legal aid.",
      "hint": null
    },
    {
      "id": "q5",
      "type": "short-answer",
      "question": "Rape is on the rise in Kenya affecting many families:",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Management follows a holistic approach (Medical, Forensic, Psychological): Immediate Triage & First Aid: Treat life-threatening physical injuries (bleeding, fractures) immediately. Ensure privacy and obtain consent. History Taking: Take a detailed history of the incident (date, time, nature of assault) for medical and legal purposes. Document verbatim. Physical & Forensic Examination: Examine the whole body for injuries. Perform a speculum exam to assess genital trauma. Collect forensic samples (HVS, clothing, debris) before cleaning the patient. Fill the PRC/P3 Form. STI Prevention: Administer prophylactic antibiotics for Gonorrhea, Chlamydia, Syphilis, and Trichomoniasis (e.g., Ceftriaxone, Azithromycin/Doxycycline, Metronidazole). HIV Prevention (PEP): Assess HIV risk. Start Post-Exposure Prophylaxis (PEP) within 72 hours (optimally <4 hours). Test baseline HIV status first. Pregnancy Prevention (ECP): Administer Emergency Contraception (Levonorgestrel) within 72-120 hours if the survivor is female and of reproductive age. Tetanus & Hep B: Give Tetanus Toxoid and Hepatitis B vaccine if indicated. Psychological Support: Provide immediate trauma counseling and schedule follow-up mental health care.",
      "hint": null
    },
    {
      "id": "q6",
      "type": "short-answer",
      "question": "State five (5) health education shared with client after insertion of implants. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Wound Care: Keep the insertion site dry for at least 24 hours. Keep the pressure bandage on for 24-48 hours. Expected Side Effects: Inform about potential menstrual changes (spotting, irregular bleeding, or amenorrhea) which are normal. Pain Management: Mild pain or bruising at the site is common; take mild analgesics if needed. Effectiveness: The implant is effective within 24 hours (if inserted within first 7 days of cycle) or after 7 days otherwise. Return Date: Inform on the lifespan (3 or 5 years) but emphasize she can return anytime for removal or if she experiences problems (infection signs, severe pain).",
      "hint": null
    },
    {
      "id": "q7",
      "type": "short-answer",
      "question": "State FIVE (5) reasons for low uptake of long-term family planning methods in Kenya. (5 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Myths and Misconceptions: Fear of infertility, migration of implants in the body, or interference with libido. Provider Bias: Health workers may prefer short-term methods or deny LARC to nulliparous women/youth. Lack of Skilled Staff: Shortage of providers trained in insertion and removal of IUCDs/Implants. Stock-outs: Unreliable supply chain for LARC commodities and equipment. Cost: Although often free in public facilities, associated costs (transport, registration) or cost in private sector may be a barrier. Fear of Side Effects: Concerns about bleeding patterns or pain during insertion.",
      "hint": null
    },
    {
      "id": "q8",
      "type": "short-answer",
      "question": "State FOUR (4) advantages of lactational amenorrhea as a method of family planning. (4 Marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Effective: 98% effective if all three criteria (amenorrhea, exclusive breastfeeding, <6 months) are met. Cost-free: Requires no commodities or financial investment. Immediate: Can be started immediately after birth. Health Benefits: Promotes exclusive breastfeeding which boosts infant immunity and nutrition. No Side Effects: Natural method with no hormonal or physical side effects for the mother.",
      "hint": null
    },
    {
      "id": "q9",
      "type": "short-answer",
      "question": "State THREE (3) WHO Medical Eligibility Criteria guidelines on safety provision of contraceptive methods to clients with medical conditions. (6 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "The WHO MEC categorizes medical conditions to determine safety: Category 1: A condition for which there is no restriction for the use of the contraceptive method. (Use method in any circumstances). Category 2: A condition where the advantages of using the method generally outweigh the theoretical or proven risks . (Generally use). Category 3: A condition where the theoretical or proven risks usually outweigh the advantages of using the method. (Use only if no other method is available/acceptable; requires careful monitoring). Category 4: A condition which represents an unacceptable health risk if the contraceptive method is used. (Do not use). (Any 3 categories explained).",
      "hint": null
    },
    {
      "id": "q10",
      "type": "short-answer",
      "question": "Jane, 40 years old lady comes to your health facility for Family Planning Method. After counselling she makes an informed choice of IUCD.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Long-term protection: Copper T 380A is effective for up to 12 years. Reversibility: Fertility returns immediately after removal. Non-hormonal: Copper IUD has no hormonal side effects (suitable for those who cannot use hormones). Cost-effective: Low cost over time compared to short-term methods. Convenience: \"Forgettable\" method; requires no daily action or interruption of sex.",
      "hint": null
    }
  ]
}