{
  "id": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491_86bdfea6-a9a0-4934-8a30-b4ce8f300f32_002",
  "title": "Quiz 2: Cardiovascular and Hematology",
  "subjectId": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491",
  "topicId": "86bdfea6-a9a0-4934-8a30-b4ce8f300f32",
  "topicName": "Cardiovascular & Hematology Collection",
  "description": "Diploma in Community Health Nursing - Year 1 Semester 2",
  "isPaid": true,
  "timeLimit": 20,
  "passingScore": 70,
  "version": 1,
  "order": 2,
  "questions": [
    {
      "id": "q1",
      "type": "short-answer",
      "question": "Distinguish any three (3) modifiable and non-modifiable risk factors for hypertension (6 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Modifiable Risk Factors (Can be changed) Non-Modifiable Risk Factors (Cannot be changed) 1. Diet: High salt intake, low potassium intake. 1. Age: Risk increases with age. 2. Obesity/Overweight: Excess weight increases strain on the heart. 2. Family History/Genetics: Presence of HTN in close relatives. 3. Physical Inactivity: Sedentary lifestyle. 3. Race/Ethnicity: Higher prevalence in African descent. 4. Substance Use: Tobacco smoking, excessive alcohol consumption. 4. Gender: Men > Women until menopause.",
      "hint": null
    },
    {
      "id": "q2",
      "type": "short-answer",
      "question": "State five (5) types of emboli in venous conditions (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Thromboembolism: A blood clot (thrombus) that detaches (Most common). Fat Embolism: Fat globules released after long bone fractures. Air/Gas Embolism: Air bubbles entering the vein (e.g., via IV lines). Amniotic Fluid Embolism: Amniotic fluid entering maternal circulation during labor. Septic Embolism: Clumps of bacteria/pus from an infected site. Tumor Embolism: Fragments of cancer cells.",
      "hint": null
    },
    {
      "id": "q3",
      "type": "short-answer",
      "question": "State five (5) specific nursing management of a patient with hypertension (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Monitor Vital Signs: Regularly check Blood Pressure (standing and sitting) to assess control and detect orthostatic hypotension. Medication Administration: Administer anti-hypertensives as ordered and monitor for side effects (e.g., cough with ACEIs). Dietary Management: Enforce a low-sodium (DASH) diet and weight management strategies. Patient Education: Teach about the importance of adherence, lifestyle modifications (exercise, smoking cessation), and stress management. Monitoring Complications: Assess for signs of end-organ damage (vision changes, edema, chest pain, proteinuria).",
      "hint": null
    },
    {
      "id": "q4",
      "type": "short-answer",
      "question": "Outline the four (4) classifications of Heart Failure according to the patient's symptoms (4 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "NYHA (New York Heart Association) Functional Classification: Class I: No limitation of physical activity. Ordinary physical activity does not cause undue fatigue, palpitation, or dyspnea. Class II: Slight limitation of physical activity. Comfortable at rest. Ordinary physical activity results in fatigue, palpitation, or dyspnea. Class III: Marked limitation of physical activity. Comfortable at rest. Less than ordinary activity causes fatigue, palpitation, or dyspnea. Class IV: Unable to carry on any physical activity without discomfort. Symptoms of heart failure at rest. If any physical activity is undertaken, discomfort increases.",
      "hint": null
    },
    {
      "id": "q5",
      "type": "short-answer",
      "question": "A 60- year old patient is admitted to the medical ward with a diagnosis of uncomplicated myocardial infarction.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Severe Chest Pain: Crushing, squeezing, or radiating pain (to jaw, arm, back) unrelieved by rest or nitrates. Dyspnea: Shortness of breath. Diaphoresis: Profuse sweating (cold/clammy skin). Nausea and Vomiting. Anxiety: Feeling of impending doom.",
      "hint": null
    },
    {
      "id": "q6",
      "type": "short-answer",
      "question": "State five (5) nursing interventions for a client on treatment for thalassemia (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Blood Transfusion Management: Administer packed RBCs as ordered to maintain Hb levels and monitor for transfusion reactions. Chelation Therapy: Administer iron-chelating agents (e.g., Desferal) to prevent iron overload (hemosiderosis) from frequent transfusions. Infection Prevention: Educate on hygiene and ensure timely vaccinations (especially if splenectomy is done). Nutritional Support: Advise on folic acid supplements; discourage iron-rich foods. Genetic Counseling: Provide information/referral for genetic counseling for the family.",
      "hint": null
    },
    {
      "id": "q7",
      "type": "short-answer",
      "question": "Elucidate five (5) major causes of thrombocytopenia (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Decreased Production: Bone marrow suppression (Aplastic anemia, Leukemia, Chemotherapy). Increased Destruction: Autoimmune disorders (ITP - Idiopathic Thrombocytopenic Purpura, Lupus). Sequestration: Hypersplenism (enlarged spleen traps platelets). Consumption: Disseminated Intravascular Coagulation (DIC). Drug-Induced: Heparin-Induced Thrombocytopenia (HIT), certain antibiotics.",
      "hint": null
    },
    {
      "id": "q8",
      "type": "short-answer",
      "question": "State any five (5) causes of folate deficiency anemia (5marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Dietary Deficiency: Lack of green leafy vegetables, liver, yeast. Malabsorption: Celiac disease, Crohn's disease. Increased Demand: Pregnancy, lactation, rapid growth in infancy. Drugs: Anticonvulsants (Phenytoin), Methotrexate, Trimethoprim. Alcoholism: Alcohol interferes with folate absorption and metabolism.",
      "hint": null
    },
    {
      "id": "q9",
      "type": "short-answer",
      "question": "State five (5) clinical manifestations of a patient diagnosed with Polycythemia vera (5marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Plethora: Ruddy complexion (reddish skin/face). Pruritus: Generalized itching, especially after a warm bath (aquagenic pruritus). Headache and Dizziness: Due to hyperviscosity and poor perfusion. Hypertension: Increased blood volume/viscosity. Thrombosis: Increased risk of clots (DVT, Stroke, MI). Splenomegaly: Enlarged spleen.",
      "hint": null
    },
    {
      "id": "q10",
      "type": "short-answer",
      "question": "A 30- year is admitted to the medical ward with a diagnosis of sickle cell crisis.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Vaso-occlusive Crisis (Painful Crisis): Obstruction of blood flow causing ischemia and severe pain. Sequestration Crisis: Pooling of blood in the spleen (less common in adults due to autosplenectomy, but possible in liver/lungs). Aplastic Crisis: Temporary cessation of RBC production, often triggered by Parvovirus B19. (Hemolytic Crisis is another type - rapid destruction of RBCs).",
      "hint": null
    }
  ]
}