{
  "id": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491_7c7cb000-8936-4e11-b2f4-96f844f5febb_004",
  "title": "Quiz 4: Community Health Nursing II & Immunization",
  "subjectId": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491",
  "topicId": "7c7cb000-8936-4e11-b2f4-96f844f5febb",
  "topicName": "1.2 Community Health Nursing Collection",
  "description": "Diploma in Community Health Nursing - Year 1 Semester 2",
  "isPaid": true,
  "timeLimit": 20,
  "passingScore": 70,
  "version": 1,
  "order": 4,
  "questions": [
    {
      "id": "q1",
      "type": "short-answer",
      "question": "State the six (6) life cycle cohorts. (6 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "The Kenya Essential Package for Health (KEPH) defines 6 life cycle cohorts to target health services effectively: Cohort 1: Pregnancy and the newborn (Conception to 2 weeks). Cohort 2: Early Childhood (2 weeks to 5 years). Cohort 3: Late Childhood (6 to 12 years). Cohort 4: Adolescents and Youth (13 to 24 years). Cohort 5: Adulthood (25 to 59 years). Cohort 6: The Elderly (60 years and above).",
      "hint": null
    },
    {
      "id": "q2",
      "type": "short-answer",
      "question": "State five (5) advantages of integrated health services. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Efficiency: Maximizes the use of limited resources (staff, equipment, time). Convenience: Clients receive multiple services (e.g., Immunization and Family Planning) in one visit, saving time and transport costs. Reduced Missed Opportunities: Increases the likelihood of catching up on missed services (e.g., vaccinating a child while treating the mother). Holistic Care: Addresses the client's needs comprehensively rather than in fragments. Improved Satisfaction: Enhances client satisfaction due to reduced waiting times and \"one-stop-shop\" approach.",
      "hint": null
    },
    {
      "id": "q3",
      "type": "short-answer",
      "question": "Outline four (4) roles of a nurse in school health program. (4 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Health Educator: Teaching students, staff, and parents about hygiene, nutrition, and disease prevention. Care Provider: Administering first aid and treating minor ailments. Screener: Conducting routine health assessments (vision, hearing, growth monitoring) to identify defects. Counselor: Providing guidance on mental health, reproductive health, and social issues. Liaison: Connecting the school with the health facility and community resources.",
      "hint": null
    },
    {
      "id": "q4",
      "type": "short-answer",
      "question": "State five (5) constraints of home visiting. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Time Consuming: Travel and personalized interaction take significant time per client. Costly: High transport and personnel costs compared to facility-based care. Safety Risks: Health workers may face security threats (dogs, crime) or environmental hazards. Weather Challenges: Rain or extreme heat can hinder access to homes. Lack of Acceptance: Families may feel their privacy is invaded or may not welcome strangers. Workload: High caseloads may lead to burnout and reduced quality of visits.",
      "hint": null
    },
    {
      "id": "q5",
      "type": "short-answer",
      "question": "The Kenya Vision 2030 aims to transform Kenya into a newly industrializing, middle – income country providing a high quality of life to all its citizens by 2030 in a clean and secure environment.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Macroeconomic stability for long-term development: Ensuring consistent economic growth. Continuity in governance reforms: Building on previous achievements in governance. Enhanced equity and wealth creation opportunities: Ensuring benefits reach the poor. Infrastructure: Developing energy, transport, and water systems. Science, Technology, and Innovation (STI): Harnessing knowledge for development. Land Reform: Efficient land management. Human Resources Development: Investing in education and health. Security: Ensuring peace and safety for all.",
      "hint": null
    },
    {
      "id": "q6",
      "type": "short-answer",
      "question": "Explain how you would maintain cold chain during immunization session. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Use a Vaccine Carrier: Transport vaccines from the fridge to the session site using a vaccine carrier with conditioned ice packs. Keep Carrier Closed: Keep the lid of the vaccine carrier closed tightly when not accessing vaccines to maintain internal temperature. Use Foam Pad: Place the reconstituted vaccine vial in the foam pad provided in the carrier to keep it cool and protected from light. Avoid Sunlight/Heat: Position the vaccination table away from direct sunlight and heat sources. Monitor VVM: Regularly check the Vaccine Vial Monitor (VVM) status before administration. Discard Policy: Discard reconstituted vaccines (BCG, Measles) after 6 hours or at the end of the session, whichever comes first.",
      "hint": null
    },
    {
      "id": "q7",
      "type": "short-answer",
      "question": "State 5 important factors that a nurse should consider in observing multidose vial policy. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "The Multi-Dose Vial Policy (MDVP) allows opened vials of certain vaccines (OPV, TT, Penta, HepB, PCV - usually liquid with preservatives) to be kept for up to 28 days if: The expiry date has not passed. The vaccine has been stored under appropriate cold chain conditions (+2°C to +8°C). The vaccine vial septum has not been submerged in water (to prevent contamination). Aseptic technique was used to withdraw all doses (needle left in vial is prohibited). The Vaccine Vial Monitor (VVM) has not reached the discard point (stage 3 or 4).",
      "hint": null
    },
    {
      "id": "q8",
      "type": "short-answer",
      "question": "State 5 obligations of the ministry of health towards immunization services. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Procurement and Supply: Ensuring a steady supply of high-quality vaccines and injection materials (syringes, safety boxes). Cold Chain Maintenance: Providing and maintaining cold chain equipment (fridges, freezers) at all levels. Policy and Guidelines: Developing and disseminating immunization policies, schedules, and standard operating procedures. Capacity Building: Training and updating health workers on immunization practices. Monitoring and Evaluation: Conducting surveillance of vaccine-preventable diseases and monitoring coverage rates. Social Mobilization: Conducting advocacy and public awareness campaigns to promote uptake.",
      "hint": null
    },
    {
      "id": "q9",
      "type": "short-answer",
      "question": "Describe strategies that a nurse can use to ensure high immunization coverage. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Outreach Services: Conducting regular mobile clinics in hard-to-reach or underserved areas (\"Reach Every District\" strategy). Defaulter Tracing: Using community health volunteers to identify and follow up on children who missed appointments. Health Education: Educating mothers and the community on the importance of completing the immunization schedule. Integration: Checking the immunization status of every sick child visiting the facility and vaccinating eligible ones (reducing missed opportunities). Availability: Ensuring vaccines are always in stock and services are available daily. Incentives/Reminders: Using SMS reminders or community mobilization to encourage attendance.",
      "hint": null
    },
    {
      "id": "q10",
      "type": "short-answer",
      "question": "You are newly qualified Nurse posted to a health facility as a nursing officer in charge. During your orientation you observe that immunization uptake is low.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Health System Factors: Frequent stock-outs of vaccines or supplies. Shortage of staff leading to long waiting times. Poor attitude of health workers discouraging mothers. Geographical Factors: Long distance to the health facility. Difficult terrain or lack of transport. Nomadic lifestyle of the population. Knowledge and Information: Lack of awareness among mothers about the immunization schedule. Myths and misconceptions about vaccines (e.g., they cause infertility). Socio-Economic Factors: Poverty (mother cannot afford transport). Maternal workload (too busy to bring child). Cultural/Religious Factors: Religious sects prohibiting modern medicine. Cultural beliefs against injections.",
      "hint": null
    }
  ]
}