{
  "id": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491_4f440cd5-a849-4de8-8bcd-22743a69dba6_003",
  "title": "Quiz 3: Medical Surgical Nursing 1 & Specialised Procedures",
  "subjectId": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491",
  "topicId": "4f440cd5-a849-4de8-8bcd-22743a69dba6",
  "topicName": "1.2 Medical-Surgical Nursing Collection",
  "description": "Diploma in Community Health Nursing - Year 1 Semester 2",
  "isPaid": true,
  "timeLimit": 20,
  "passingScore": 70,
  "version": 1,
  "order": 3,
  "questions": [
    {
      "id": "q1",
      "type": "short-answer",
      "question": "State any five (5) risk factors of developing cellulitis in an adult. (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Skin Injury: Cuts, fractures, burns, or surgical wounds provide an entry portal for bacteria. Weakened Immune System: Conditions like Diabetes, HIV/AIDS, or leukemia impair the body's ability to fight infection. Skin Conditions: Chronic skin disorders such as eczema, athlete's foot, or shingles causing breaks in the skin. Chronic Swelling (Lymphedema): Swollen tissue can crack, allowing bacteria to enter. Obesity: Increases the risk of cellulitis and recurrence. History of Cellulitis: Previous infections increase the likelihood of recurrence.",
      "hint": null
    },
    {
      "id": "q2",
      "type": "short-answer",
      "question": "Outline any five (5) ways in which nurses can promote wound healing through various interventions (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Nutrition: Encourage a high-protein, high-calorie diet with Vitamin C and Zinc to support tissue repair. Infection Prevention: Maintain strict aseptic technique during dressing changes to prevent wound infection. Moisture Balance: Use appropriate dressings to keep the wound bed moist (but not macerated) to facilitate epithelialization. Circulation Promotion: Ensure adequate hydration and positioning (elevation) to reduce edema and improve blood flow. Pressure Relief: Regular turning/repositioning (every 2 hours) to prevent pressure ulcers and improve perfusion. Pain Management: Administer analgesics to ensure patient comfort and reduce stress response which can hinder healing.",
      "hint": null
    },
    {
      "id": "q3",
      "type": "short-answer",
      "question": "Explain the three (3) classification of burns. (6mks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Burns are typically classified by depth: Superficial (First-Degree) Burns: Involves only the epidermis. Skin is red, painful, and dry with no blisters (e.g., mild sunburn). Heals in 3-5 days without scarring. Partial-Thickness (Second-Degree) Burns: Involves the epidermis and part of the dermis. Skin is red, blistered, swollen, and extremely painful. Can be superficial partial or deep partial thickness. Heals in 2-3 weeks, may scar. Full-Thickness (Third-Degree) Burns: Destroys the entire epidermis and dermis, potentially reaching subcutaneous fat, muscle, or bone. Wound appears white, charred, or leathery. Pain is often absent due to nerve destruction. Requires grafting to heal.",
      "hint": null
    },
    {
      "id": "q4",
      "type": "short-answer",
      "question": "State any four (4) causes of respiratory acidosis (4 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Respiratory acidosis is caused by hypoventilation (retention of CO2). Causes include: Chronic Obstructive Pulmonary Disease (COPD): Emphysema, chronic bronchitis. CNS Depression: Overdose of opioids, sedatives, or anesthesia causing reduced respiratory drive. Chest Wall Abnormalities: Flail chest, severe kyphoscoliosis restricting lung expansion. Neuromuscular Disorders: Guillain-Barre syndrome, Myasthenia Gravis affecting respiratory muscles. Airway Obstruction: Foreign body aspiration, severe asthma attack. Pulmonary Edema/Pneumonia: Severe infection or fluid impairing gas exchange.",
      "hint": null
    },
    {
      "id": "q5",
      "type": "short-answer",
      "question": "A 62-year-old male patient is admitted to the emergency department with symptoms of shock. The patient has a history of hypertension and undergoing treatment for coronary artery bypass graft surgery. He is presenting with hypotension, tachycardia, cool and clammy skin, altered mental status, and oliguria. The nurse suspects the patient is in a state of shock.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Shock is a state of inadequate tissue perfusion. Initial Insult: A precipitating event (e.g., heart failure in this case) leads to decreased Cardiac Output (CO) and hypotension. Compensatory Mechanisms: Baroreceptors detect low BP, stimulating the Sympathetic Nervous System (SNS). This causes vasoconstriction (cool skin), increased heart rate (tachycardia), and activation of the Renin-Angiotensin-Aldosterone System (RAAS) to retain fluid (oliguria). Cellular Hypoxia: Despite compensation, perfusion remains inadequate. Cells switch from aerobic to anaerobic metabolism due to lack of oxygen. Lactic Acidosis: Anaerobic metabolism produces lactic acid, leading to metabolic acidosis. This impairs cellular function and cell membrane integrity. Organ Dysfunction: If untreated, cellular damage leads to Multiple Organ Dysfunction Syndrome (MODS) and death.",
      "hint": null
    },
    {
      "id": "q6",
      "type": "short-answer",
      "question": "State five (5) contraindications for hemodialysis (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Hemodynamic Instability: Severe hypotension or shock (patient cannot tolerate fluid shift). Lack of Vascular Access: Inability to establish a fistula, graft, or catheter. Severe Coagulopathy: Inability to use anticoagulants (heparin) required for the circuit. Advanced Dementia/Psychosis: Inability to cooperate with the procedure. Terminal Illness: Where dialysis would not improve quality of life (relative contraindication).",
      "hint": null
    },
    {
      "id": "q7",
      "type": "short-answer",
      "question": "Outline five (5) diagnostic and therapeutic purposes for bronchoscopy (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Diagnostic: Visualization of tumors or strictures. Diagnostic: Biopsy of tissue for histology. Diagnostic: Collection of secretions (sputum) for culture/cytology. Therapeutic: Removal of foreign bodies. Therapeutic: Suctioning of thick mucous plugs/secretions. Therapeutic: Control of bleeding (hemostasis).",
      "hint": null
    },
    {
      "id": "q8",
      "type": "short-answer",
      "question": "Outline five (5) benefits of voluntary male medical circumcision (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Reduces risk of acquiring HIV infection in heterosexual men (by approx. 60%). Improves penile hygiene (smegma reduction). Reduces risk of other STIs (Herpes, Syphilis, HPV). Reduces risk of Penile Cancer. Reduces risk of Cervical Cancer in female partners (by reducing HPV transmission).",
      "hint": null
    },
    {
      "id": "q9",
      "type": "short-answer",
      "question": "State five (5) advantages of a tracheostomy (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Bypasses upper airway obstruction. Reduces anatomical dead space (improves ventilation efficiency). Facilitates easier removal of tracheobronchial secretions (suctioning). More comfortable than an endotracheal tube (ETT) for long-term ventilation. Allows the patient to eat and speak (with appropriate valves/cuffs) unlike ETT.",
      "hint": null
    },
    {
      "id": "q10",
      "type": "short-answer",
      "question": "Mr. X has been admitted in the medical-surgical ward with a diagnosis of diabetes mellitus, schedule to undergo below-knee amputation. He's due for blood transfusion prior undergoing the procedure.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Severe Anemia: To restore oxygen-carrying capacity (e.g., Hb < 7-8 g/dL). Acute Hemorrhage/Blood Loss: To restore blood volume (e.g., trauma, surgery). Coagulopathy: Deficiency of clotting factors (e.g., Hemophilia, DIC). Thrombocytopenia: Low platelet count causing bleeding. Hypoproteinemia: Severe protein deficiency (using Albumin/Plasma).",
      "hint": null
    }
  ]
}