{
  "id": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491_b448aedf-1bb1-45c0-b6f0-e4efa64d216b_001",
  "title": "Quiz 1: Pharmacology 1",
  "subjectId": "dip_community_health_nursing_kmtc_1_2__pastpapers_collection_1769687069491",
  "topicId": "b448aedf-1bb1-45c0-b6f0-e4efa64d216b",
  "topicName": "1.2 Pharmacology Collection",
  "description": "Diploma in Community Health Nursing - Year 1 Semester 2",
  "isPaid": true,
  "timeLimit": 20,
  "passingScore": 70,
  "version": 1,
  "order": 1,
  "questions": [
    {
      "id": "q1",
      "type": "short-answer",
      "question": "List six (6) drugs in the class of non-steroidal anti-inflammatory drugs (3 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Aspirin (Acetylsalicylic Acid) Ibuprofen Diclofenac Naproxen Indomethacin Celecoxib (COX-2 inhibitor) Meloxicam Ketorolac (Any 6 for 0.5 marks each)",
      "hint": null
    },
    {
      "id": "q2",
      "type": "short-answer",
      "question": "Outline five (5) established target sites for antiretroviral drugs (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Viral Entry/Fusion: Blocking the virus from binding to or entering the CD4 cell (Entry/Fusion Inhibitors, CCR5 Antagonists). Reverse Transcription: Inhibiting the conversion of viral RNA to DNA (Nucleoside/Nucleotide Reverse Transcriptase Inhibitors - NRTIs, and Non-Nucleoside Reverse Transcriptase Inhibitors - NNRTIs). Integration: Blocking the integration of viral DNA into the host cell's genetic material (Integrase Strand Transfer Inhibitors - INSTIs). Proteolytic Cleavage (Maturation): Preventing the processing of viral proteins into functional units required for assembly of new viruses (Protease Inhibitors - PIs). Capsid Function: Interfering with the viral capsid to prevent transport and replication (Capsid Inhibitors - Newer class).",
      "hint": null
    },
    {
      "id": "q3",
      "type": "short-answer",
      "question": "Explain three (3) mechanisms of drug action (6 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Receptor Interaction: Drugs bind to specific receptors on cell surfaces or intracellularly. They can act as Agonists (mimicking the body's own regulatory molecules to activate a response) or Antagonists (blocking the receptor to prevent a response). Enzyme Inhibition: Drugs may bind to enzymes to alter their activity. This can inhibit the synthesis of specific compounds (e.g., ACE inhibitors blocking Angiotensin Converting Enzyme) or prevent the breakdown of neurotransmitters. Non-specific Physical or Chemical Action: Some drugs work through simple physical or chemical properties without binding to specific receptors. Examples include Antacids (chemical neutralization of acid) or Osmotic Diuretics (increasing osmolarity). Ion Channel Modulation: Drugs block or open ion channels (Sodium, Calcium, Potassium channels) to alter the electrical potential of cells (e.g., Local anesthetics blocking Na+ channels).",
      "hint": null
    },
    {
      "id": "q4",
      "type": "short-answer",
      "question": "Explain three (3) roles of nurses in pharmacology (6 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Safe Administration: Ensuring the \"Rights of Medication Administration\" (Right patient, drug, dose, route, time, documentation) are followed to prevent errors. Patient Education: Teaching patients about their medications, including purpose, dosage, administration techniques, and potential side effects to ensure compliance and safety. Monitoring and Evaluation: Assessing the patient's response to the drug (therapeutic effectiveness) and monitoring for adverse drug reactions or toxicity. Assessment: Taking a thorough medication history, including allergies and current medications, before administration to prevent interactions or allergic reactions.",
      "hint": null
    },
    {
      "id": "q5",
      "type": "short-answer",
      "question": "Explain three (3) therapeutic uses of acetylsalicylic acid (Asprin) (6 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Analgesic: Used to relieve mild to moderate pain (e.g., headache, muscle ache). Antipyretic: Used to lower fever by acting on the hypothalamus heat-regulating center. Anti-inflammatory: Used to reduce inflammation and swelling in conditions like Rheumatoid Arthritis. Antiplatelet: Used in low doses (75-81mg) to inhibit platelet aggregation, preventing blood clots in patients at risk of Myocardial Infarction or Stroke.",
      "hint": null
    },
    {
      "id": "q6",
      "type": "short-answer",
      "question": "Explain the mechanism of action of salbutamol (4 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Salbutamol is a selective Beta-2 Adrenergic Agonist . It stimulates beta-2 receptors located on the smooth muscles of the bronchioles. This stimulation activates the enzyme adenyl cyclase, which increases intracellular Cyclic AMP (cAMP). Increased cAMP leads to relaxation of the bronchial smooth muscles, resulting in bronchodilation and relief of airway obstruction (e.g., in Asthma).",
      "hint": null
    },
    {
      "id": "q7",
      "type": "short-answer",
      "question": "State five (5) nursing considerations while administering digoxin (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Assess Apical Pulse: Check apical pulse for a full minute before administration. Withhold if pulse is <60 bpm (adults) or <90 bpm (infants). Monitor Potassium Levels: Hypokalemia increases the risk of digoxin toxicity. Monitor serum electrolytes. Monitor for Toxicity signs: Watch for anorexia, nausea, vomiting, visual disturbances (yellow/green halos), and arrhythmias. Check Serum Digoxin Levels: Ensure levels are within the therapeutic window (0.5–2.0 ng/mL) to prevent toxicity. Education: Teach patient how to take their own pulse and to report symptoms of toxicity immediately.",
      "hint": null
    },
    {
      "id": "q8",
      "type": "short-answer",
      "question": "State five (5) major adverse reactions associated with amphotericin B (5 marks)",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Nephrotoxicity: Renal impairment is very common; monitor BUN/Creatinine. Infusion Reactions: Fever, chills, rigors, and headache during infusion (\"Shake and Bake\"). Hypokalemia: Severe loss of potassium requiring supplementation. Bone Marrow Suppression: Can lead to Anemia. Thrombophlebitis: Irritation of the vein at the injection site.",
      "hint": null
    },
    {
      "id": "q9",
      "type": "short-answer",
      "question": "Patient X is newly diagnosed with hypertension. He is to be initiated on anti-hypertensive drugs.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Diuretics: Increase urine output to reduce blood volume and cardiac output. Example: Hydrochlorothiazide (Thiazide), Furosemide (Loop). Angiotensin-Converting Enzyme (ACE) Inhibitors: Block the conversion of Angiotensin I to Angiotensin II (a potent vasoconstrictor), leading to vasodilation. Example: Enalapril, Captopril, Lisinopril. Angiotensin II Receptor Blockers (ARBs): Block Angiotensin II from binding to its receptors on blood vessels, causing vasodilation. Example: Losartan, Candesartan. Calcium Channel Blockers (CCBs): Block calcium influx into vascular smooth muscle and heart muscle, causing vasodilation and reduced heart rate. Example: Nifedipine, Amlodipine, Verapamil. Beta-Adrenergic Blockers (Beta Blockers): Block beta receptors in the heart, reducing heart rate and contractility (Cardiac Output). Example: Atenolol, Propranolol, Metoprolol.",
      "hint": null
    },
    {
      "id": "q10",
      "type": "short-answer",
      "question": "Patient X has been prescribed a sedative-hypnotic drug.",
      "points": 20,
      "acceptedAnswers": [],
      "caseSensitive": false,
      "partialMatch": false,
      "explanation": "Benzodiazepines (e.g., Diazepam, Lorazepam). Barbiturates (e.g., Phenobarbital, Thiopental). Non-benzodiazepine receptor agonists (\"Z-drugs\") (e.g., Zolpidem, Zopiclone).",
      "hint": null
    }
  ]
}